zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_CPE_LLC_1.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_CPE_LLC_1
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_CPE_LLC_1_H_)  /* Check if memory map has not been already included */
#define S32K566_CPE_LLC_1_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- CPE_LLC_1 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_LLC_1_Peripheral_Access_Layer CPE_LLC_1 Peripheral Access Layer
 * @{
 */

/** CPE_LLC_1 - Register Layout Typedef */
typedef struct CPE_LLC_1_Struct {
  __IO uint32_t CCUTCR;                            /**< Transaction Control, offset: 0x0 */
  __I  uint32_t CCUTAR;                            /**< Transaction Activity, offset: 0x4 */
  uint8_t RESERVED_0[8];
  __IO uint32_t CCUCTCR;                           /**< Cache Transaction Control, offset: 0x10 */
  __I  uint32_t CCUCTAR;                           /**< Cache Transaction Activity, offset: 0x14 */
  __IO uint32_t CCUCAOR;                           /**< Allocation Override, offset: 0x18 */
  uint8_t RESERVED_1[4];
  __IO uint32_t CCUSPCR0;                          /**< Scratchpad Configuration 0, offset: 0x20 */
  __IO uint32_t CCUSPCR1;                          /**< Scratchpad Configuration 1, offset: 0x24 */
  __IO uint32_t CCUSPBR0;                          /**< Scratchpad Base Address 0, offset: 0x28 */
  uint8_t RESERVED_2[20];
  __IO uint32_t CCUWPCR00;                         /**< Way Partitioning Control, offset: 0x40 */
  __IO uint32_t CCUWPCR10;                         /**< Way Partitioning Control, offset: 0x44 */
  __IO uint32_t CCUWPCR01;                         /**< Way Partitioning Control, offset: 0x48 */
  __IO uint32_t CCUWPCR11;                         /**< Way Partitioning Control, offset: 0x4C */
  __IO uint32_t CCUWPCR02;                         /**< Way Partitioning Control, offset: 0x50 */
  __IO uint32_t CCUWPCR12;                         /**< Way Partitioning Control, offset: 0x54 */
  __IO uint32_t CCUWPCR03;                         /**< Way Partitioning Control, offset: 0x58 */
  __IO uint32_t CCUWPCR13;                         /**< Way Partitioning Control, offset: 0x5C */
  __IO uint32_t CCUWPCR04;                         /**< Way Partitioning Control, offset: 0x60 */
  __IO uint32_t CCUWPCR14;                         /**< Way Partitioning Control, offset: 0x64 */
  __IO uint32_t CCUWPCR05;                         /**< Way Partitioning Control, offset: 0x68 */
  __IO uint32_t CCUWPCR15;                         /**< Way Partitioning Control, offset: 0x6C */
  __IO uint32_t CCUWPCR06;                         /**< Way Partitioning Control, offset: 0x70 */
  __IO uint32_t CCUWPCR16;                         /**< Way Partitioning Control, offset: 0x74 */
  __IO uint32_t CCUWPCR07;                         /**< Way Partitioning Control, offset: 0x78 */
  __IO uint32_t CCUWPCR17;                         /**< Way Partitioning Control, offset: 0x7C */
  uint8_t RESERVED_3[128];
  __IO uint32_t CCUCMCR;                           /**< Maintenance Control, offset: 0x100 */
  __I  uint32_t CCUCMAR;                           /**< Maintenance Activity, offset: 0x104 */
  __IO uint32_t CCUCMLR0;                          /**< Maintenance Location 0, offset: 0x108 */
  __IO uint32_t CCUCMLR1;                          /**< Maintenance Location 1, offset: 0x10C */
  __IO uint32_t CCUCMLR2;                          /**< Maintenance Location 2, offset: 0x110 */
  __IO uint32_t CCUCMDR;                           /**< Maintenance Data, offset: 0x114 */
  __IO uint32_t CCUCMWVR;                          /**< Maintenance Way Valid, offset: 0x118 */
  uint8_t RESERVED_4[36];
  __IO uint32_t CCUCECR;                           /**< Correctable Error Control, offset: 0x140 */
  __IO uint32_t CCUCESR;                           /**< Correctable Error Status, offset: 0x144 */
  __IO uint32_t CCUCESAR;                          /**< Correctable Error Status Alias, offset: 0x148 */
  __I  uint32_t CCUCELR0;                          /**< Correctable Error Location 0, offset: 0x14C */
  __I  uint32_t CCUCELR1;                          /**< Correctable Error Location 1, offset: 0x150 */
  __IO uint32_t CCUUEDR;                           /**< Uncorrectable Error Detect, offset: 0x154 */
  __IO uint32_t CCUUEIR;                           /**< Uncorrectable Error Interrupt, offset: 0x158 */
  __IO uint32_t CCUUESR;                           /**< Uncorrectable Error Status, offset: 0x15C */
  __IO uint32_t CCUUESAR;                          /**< Uncorrectable Error Status Alias, offset: 0x160 */
  __I  uint32_t CCUUELR0;                          /**< Uncorrectable Error Location 0, offset: 0x164 */
  __I  uint32_t CCUUELR1;                          /**< Uncorrectable Error Location 1, offset: 0x168 */
  uint8_t RESERVED_5[80];
  __I  uint32_t CCUIIDR;                           /**< Instance Identification, offset: 0x1BC */
  __I  uint32_t CCUIDR;                            /**< Version Identification, offset: 0x1C0 */
  __IO uint32_t CCUCRTR;                           /**< Correctable Resiliency Threshold, offset: 0x1C4 */
  __IO uint32_t CCUESR;                            /**< Event Status, offset: 0x1C8 */
  __IO uint32_t CCUEMR;                            /**< Event Mask, offset: 0x1CC */
  __IO uint32_t CCUEAR;                            /**< Event Alias, offset: 0x1D0 */
  uint8_t RESERVED_6[556];
  __I  uint32_t CCUHI;                             /**< Hardware Information, offset: 0x400 */
  uint8_t RESERVED_7[60];
  __I  uint32_t CCUPMHI;                           /**< Performance Monitor Hardware Information, offset: 0x440 */
  uint8_t RESERVED_8[60];
  __IO uint32_t CCUPMCTL;                          /**< Performance Monitor Control, offset: 0x480 */
  __IO uint32_t CCUPMSC;                           /**< Performance Monitor Slot Configuration, offset: 0x484 */
  __IO uint32_t CCUPMOTC;                          /**< Performance Monitor OTT Threshold Configuration, offset: 0x488 */
  uint8_t RESERVED_9[116];
  __I  uint32_t CCUPMCYCO;                         /**< Performance Monitor Cycle Counter, offset: 0x500 */
  uint8_t RESERVED_10[60];
  __I  uint32_t CCUPMCYCA;                         /**< Performance Monitor Cycle Counter Capture, offset: 0x540 */
  uint8_t RESERVED_11[188];
  __I  uint32_t CCUPMRRCO;                         /**< Performance Monitor Read Request Counter, offset: 0x600 */
  __I  uint32_t CCUPMWRCO;                         /**< Performance Monitor Write Request Counter, offset: 0x604 */
  __I  uint32_t CCUPMCRRCO;                        /**< Performance Monitor Cacheable Read Request Counter, offset: 0x608 */
  __I  uint32_t CCUPMCWRCO;                        /**< Performance Monitor Cacheable Write Request Counter, offset: 0x60C */
  __I  uint32_t CCUPMRHCO;                         /**< Performance Monitor Read Hit Counter, offset: 0x610 */
  __I  uint32_t CCUPMWHCO;                         /**< Performance Monitor Write Hit Counter, offset: 0x614 */
  __I  uint32_t CCUPMECO;                          /**< Performance Monitor Eviction Counter, offset: 0x618 */
  __I  uint32_t CCUPMRBCO;                         /**< Performance Monitor Read Beat Counter, offset: 0x61C */
  __I  uint32_t CCUPMWBCO;                         /**< Performance Monitor Write Beat Counter, offset: 0x620 */
  __I  uint32_t CCUPMRATCO;                        /**< Performance Monitor RTT Above Threshold Counter, offset: 0x624 */
  __I  uint32_t CCUPMWATCO;                        /**< Performance Monitor WTT Above Threshold Counter, offset: 0x628 */
  uint8_t RESERVED_12[20];
  __I  uint32_t CCUPMRRCA;                         /**< Performance Monitor Read Request Counter Capture, offset: 0x640 */
  __I  uint32_t CCUPMWRCA;                         /**< Performance Monitor Write Request Counter Capture, offset: 0x644 */
  __I  uint32_t CCUPMCRRCA;                        /**< Performance Monitor Cacheable Read Request Counter Capture, offset: 0x648 */
  __I  uint32_t CCUPMCWRCA;                        /**< Performance Monitor Cacheable Write Request Counter Capture, offset: 0x64C */
  __I  uint32_t CCUPMRHCA;                         /**< Performance Monitor Read Hit Counter Capture, offset: 0x650 */
  __I  uint32_t CCUPMWHCA;                         /**< Performance Monitor Write Hit Counter Capture, offset: 0x654 */
  __I  uint32_t CCUPMECA;                          /**< Performance Monitor Eviction Counter Capture, offset: 0x658 */
  __I  uint32_t CCUPMRBCA;                         /**< Performance Monitor Read Beat Counter Capture, offset: 0x65C */
  __I  uint32_t CCUPMWBCA;                         /**< Performance Monitor Write Beat Counter Capture, offset: 0x660 */
  __I  uint32_t CCUPMRATCA;                        /**< Performance Monitor RTT Above Threshold Counter Capture, offset: 0x664 */
  __I  uint32_t CCUPMWATCA;                        /**< Performance Monitor WTT Above Threshold Counter Capture, offset: 0x668 */
} CPE_LLC_1_Type, *CPE_LLC_1_MemMapPtr;

/** Number of instances of the CPE_LLC_1 module. */
#define CPE_LLC_1_INSTANCE_COUNT                 (1u)

/* CPE_LLC_1 - Peripheral instance base addresses */
/** Peripheral CPE_LLC_1 base address */
#define IP_CPE_LLC_1_BASE                        (0x41008000u)
/** Peripheral CPE_LLC_1 base pointer */
#define IP_CPE_LLC_1                             ((CPE_LLC_1_Type *)IP_CPE_LLC_1_BASE)
/** Array initializer of CPE_LLC_1 peripheral base addresses */
#define IP_CPE_LLC_1_BASE_ADDRS                  { IP_CPE_LLC_1_BASE }
/** Array initializer of CPE_LLC_1 peripheral base pointers */
#define IP_CPE_LLC_1_BASE_PTRS                   { IP_CPE_LLC_1 }

/* ----------------------------------------------------------------------------
   -- CPE_LLC_1 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CPE_LLC_1_Register_Masks CPE_LLC_1 Register Masks
 * @{
 */

/*! @name CCUTCR - Transaction Control */
/*! @{ */

#define CPE_LLC_1_CCUTCR_TRANSEN_MASK            (0x1U)
#define CPE_LLC_1_CCUTCR_TRANSEN_SHIFT           (0U)
#define CPE_LLC_1_CCUTCR_TRANSEN_WIDTH           (1U)
#define CPE_LLC_1_CCUTCR_TRANSEN(x)              (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUTCR_TRANSEN_SHIFT)) & CPE_LLC_1_CCUTCR_TRANSEN_MASK)
/*! @} */

/*! @name CCUTAR - Transaction Activity */
/*! @{ */

#define CPE_LLC_1_CCUTAR_TRANSACTV_MASK          (0x1U)
#define CPE_LLC_1_CCUTAR_TRANSACTV_SHIFT         (0U)
#define CPE_LLC_1_CCUTAR_TRANSACTV_WIDTH         (1U)
#define CPE_LLC_1_CCUTAR_TRANSACTV(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUTAR_TRANSACTV_SHIFT)) & CPE_LLC_1_CCUTAR_TRANSACTV_MASK)
/*! @} */

/*! @name CCUCTCR - Cache Transaction Control */
/*! @{ */

#define CPE_LLC_1_CCUCTCR_LOOKUPEN_MASK          (0x1U)
#define CPE_LLC_1_CCUCTCR_LOOKUPEN_SHIFT         (0U)
#define CPE_LLC_1_CCUCTCR_LOOKUPEN_WIDTH         (1U)
#define CPE_LLC_1_CCUCTCR_LOOKUPEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCTCR_LOOKUPEN_SHIFT)) & CPE_LLC_1_CCUCTCR_LOOKUPEN_MASK)

#define CPE_LLC_1_CCUCTCR_FILLEN_MASK            (0x2U)
#define CPE_LLC_1_CCUCTCR_FILLEN_SHIFT           (1U)
#define CPE_LLC_1_CCUCTCR_FILLEN_WIDTH           (1U)
#define CPE_LLC_1_CCUCTCR_FILLEN(x)              (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCTCR_FILLEN_SHIFT)) & CPE_LLC_1_CCUCTCR_FILLEN_MASK)
/*! @} */

/*! @name CCUCTAR - Cache Transaction Activity */
/*! @{ */

#define CPE_LLC_1_CCUCTAR_EVICTACTV_MASK         (0x1U)
#define CPE_LLC_1_CCUCTAR_EVICTACTV_SHIFT        (0U)
#define CPE_LLC_1_CCUCTAR_EVICTACTV_WIDTH        (1U)
#define CPE_LLC_1_CCUCTAR_EVICTACTV(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCTAR_EVICTACTV_SHIFT)) & CPE_LLC_1_CCUCTAR_EVICTACTV_MASK)

#define CPE_LLC_1_CCUCTAR_FILLACTV_MASK          (0x2U)
#define CPE_LLC_1_CCUCTAR_FILLACTV_SHIFT         (1U)
#define CPE_LLC_1_CCUCTAR_FILLACTV_WIDTH         (1U)
#define CPE_LLC_1_CCUCTAR_FILLACTV(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCTAR_FILLACTV_SHIFT)) & CPE_LLC_1_CCUCTAR_FILLACTV_MASK)

#define CPE_LLC_1_CCUCTAR_FLUSHACTV_MASK         (0x4U)
#define CPE_LLC_1_CCUCTAR_FLUSHACTV_SHIFT        (2U)
#define CPE_LLC_1_CCUCTAR_FLUSHACTV_WIDTH        (1U)
#define CPE_LLC_1_CCUCTAR_FLUSHACTV(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCTAR_FLUSHACTV_SHIFT)) & CPE_LLC_1_CCUCTAR_FLUSHACTV_MASK)
/*! @} */

