zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
/*! @name CCUCAOR - Allocation Override */
/*! @{ */

#define CPE_LLC_1_CCUCAOR_AWALLOCEN_MASK         (0x1U)
#define CPE_LLC_1_CCUCAOR_AWALLOCEN_SHIFT        (0U)
#define CPE_LLC_1_CCUCAOR_AWALLOCEN_WIDTH        (1U)
#define CPE_LLC_1_CCUCAOR_AWALLOCEN(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCAOR_AWALLOCEN_SHIFT)) & CPE_LLC_1_CCUCAOR_AWALLOCEN_MASK)

#define CPE_LLC_1_CCUCAOR_ARALLOCEN_MASK         (0x2U)
#define CPE_LLC_1_CCUCAOR_ARALLOCEN_SHIFT        (1U)
#define CPE_LLC_1_CCUCAOR_ARALLOCEN_WIDTH        (1U)
#define CPE_LLC_1_CCUCAOR_ARALLOCEN(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCAOR_ARALLOCEN_SHIFT)) & CPE_LLC_1_CCUCAOR_ARALLOCEN_MASK)

#define CPE_LLC_1_CCUCAOR_WRALLOCPARTIALEN_MASK  (0x4U)
#define CPE_LLC_1_CCUCAOR_WRALLOCPARTIALEN_SHIFT (2U)
#define CPE_LLC_1_CCUCAOR_WRALLOCPARTIALEN_WIDTH (1U)
#define CPE_LLC_1_CCUCAOR_WRALLOCPARTIALEN(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCAOR_WRALLOCPARTIALEN_SHIFT)) & CPE_LLC_1_CCUCAOR_WRALLOCPARTIALEN_MASK)

#define CPE_LLC_1_CCUCAOR_AWALLOCVALUE_MASK      (0xF0000U)
#define CPE_LLC_1_CCUCAOR_AWALLOCVALUE_SHIFT     (16U)
#define CPE_LLC_1_CCUCAOR_AWALLOCVALUE_WIDTH     (4U)
#define CPE_LLC_1_CCUCAOR_AWALLOCVALUE(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCAOR_AWALLOCVALUE_SHIFT)) & CPE_LLC_1_CCUCAOR_AWALLOCVALUE_MASK)

#define CPE_LLC_1_CCUCAOR_ARALLOCVALUE_MASK      (0xF00000U)
#define CPE_LLC_1_CCUCAOR_ARALLOCVALUE_SHIFT     (20U)
#define CPE_LLC_1_CCUCAOR_ARALLOCVALUE_WIDTH     (4U)
#define CPE_LLC_1_CCUCAOR_ARALLOCVALUE(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCAOR_ARALLOCVALUE_SHIFT)) & CPE_LLC_1_CCUCAOR_ARALLOCVALUE_MASK)
/*! @} */

/*! @name CCUSPCR0 - Scratchpad Configuration 0 */
/*! @{ */

#define CPE_LLC_1_CCUSPCR0_SCPADEN_MASK          (0x1U)
#define CPE_LLC_1_CCUSPCR0_SCPADEN_SHIFT         (0U)
#define CPE_LLC_1_CCUSPCR0_SCPADEN_WIDTH         (1U)
#define CPE_LLC_1_CCUSPCR0_SCPADEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUSPCR0_SCPADEN_SHIFT)) & CPE_LLC_1_CCUSPCR0_SCPADEN_MASK)

#define CPE_LLC_1_CCUSPCR0_NUMSCPADWAYS_MASK     (0x70000U)
#define CPE_LLC_1_CCUSPCR0_NUMSCPADWAYS_SHIFT    (16U)
#define CPE_LLC_1_CCUSPCR0_NUMSCPADWAYS_WIDTH    (3U)
#define CPE_LLC_1_CCUSPCR0_NUMSCPADWAYS(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUSPCR0_NUMSCPADWAYS_SHIFT)) & CPE_LLC_1_CCUSPCR0_NUMSCPADWAYS_MASK)
/*! @} */

/*! @name CCUSPCR1 - Scratchpad Configuration 1 */
/*! @{ */

#define CPE_LLC_1_CCUSPCR1_SCPADSIZE_MASK        (0xFFFFFFFFU)
#define CPE_LLC_1_CCUSPCR1_SCPADSIZE_SHIFT       (0U)
#define CPE_LLC_1_CCUSPCR1_SCPADSIZE_WIDTH       (32U)
#define CPE_LLC_1_CCUSPCR1_SCPADSIZE(x)          (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUSPCR1_SCPADSIZE_SHIFT)) & CPE_LLC_1_CCUSPCR1_SCPADSIZE_MASK)
/*! @} */

/*! @name CCUSPBR0 - Scratchpad Base Address 0 */
/*! @{ */

#define CPE_LLC_1_CCUSPBR0_SCPADBASEADDR_MASK    (0xFFFFFFFFU)
#define CPE_LLC_1_CCUSPBR0_SCPADBASEADDR_SHIFT   (0U)
#define CPE_LLC_1_CCUSPBR0_SCPADBASEADDR_WIDTH   (32U)
#define CPE_LLC_1_CCUSPBR0_SCPADBASEADDR(x)      (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUSPBR0_SCPADBASEADDR_SHIFT)) & CPE_LLC_1_CCUSPBR0_SCPADBASEADDR_MASK)
/*! @} */

/*! @name CCUWPCR00 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR00_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR00_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR00_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR00_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR00_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR00_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR00_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR00_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR00_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR00_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR00_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR00_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR10 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR10_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR10_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR10_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR10_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR10_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR10_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR01 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR01_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR01_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR01_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR01_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR01_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR01_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR01_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR01_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR01_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR01_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR01_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR01_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR11 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR11_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR11_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR11_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR11_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR11_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR11_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR02 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR02_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR02_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR02_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR02_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR02_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR02_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR02_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR02_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR02_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR02_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR02_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR02_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR12 - Way Partitioning Control */
/*! @{ */

