zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
#define CPE_LLC_1_CCUWPCR12_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR12_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR12_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR12_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR12_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR12_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR03 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR03_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR03_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR03_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR03_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR03_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR03_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR03_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR03_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR03_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR03_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR03_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR03_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR13 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR13_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR13_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR13_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR13_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR13_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR13_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR04 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR04_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR04_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR04_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR04_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR04_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR04_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR04_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR04_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR04_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR04_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR04_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR04_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR14 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR14_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR14_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR14_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR14_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR14_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR14_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR05 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR05_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR05_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR05_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR05_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR05_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR05_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR05_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR05_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR05_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR05_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR05_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR05_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR15 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR15_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR15_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR15_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR15_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR15_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR15_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR06 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR06_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR06_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR06_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR06_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR06_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR06_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR06_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR06_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR06_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR06_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR06_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR06_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR16 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR16_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR16_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR16_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR16_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR16_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR16_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUWPCR07 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR07_WPAGENTID_MASK       (0xFU)
#define CPE_LLC_1_CCUWPCR07_WPAGENTID_SHIFT      (0U)
#define CPE_LLC_1_CCUWPCR07_WPAGENTID_WIDTH      (4U)
#define CPE_LLC_1_CCUWPCR07_WPAGENTID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR07_WPAGENTID_SHIFT)) & CPE_LLC_1_CCUWPCR07_WPAGENTID_MASK)

#define CPE_LLC_1_CCUWPCR07_WPAGENTIDVALID_MASK  (0x80000000U)
#define CPE_LLC_1_CCUWPCR07_WPAGENTIDVALID_SHIFT (31U)
#define CPE_LLC_1_CCUWPCR07_WPAGENTIDVALID_WIDTH (1U)
#define CPE_LLC_1_CCUWPCR07_WPAGENTIDVALID(x)    (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR07_WPAGENTIDVALID_SHIFT)) & CPE_LLC_1_CCUWPCR07_WPAGENTIDVALID_MASK)
/*! @} */

/*! @name CCUWPCR17 - Way Partitioning Control */
/*! @{ */

#define CPE_LLC_1_CCUWPCR17_WPWAYVECTOR_MASK     (0xFFU)
#define CPE_LLC_1_CCUWPCR17_WPWAYVECTOR_SHIFT    (0U)
#define CPE_LLC_1_CCUWPCR17_WPWAYVECTOR_WIDTH    (8U)
#define CPE_LLC_1_CCUWPCR17_WPWAYVECTOR(x)       (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUWPCR17_WPWAYVECTOR_SHIFT)) & CPE_LLC_1_CCUWPCR17_WPWAYVECTOR_MASK)
/*! @} */

/*! @name CCUCMCR - Maintenance Control */
/*! @{ */

#define CPE_LLC_1_CCUCMCR_MNTOP_MASK             (0xFU)
#define CPE_LLC_1_CCUCMCR_MNTOP_SHIFT            (0U)
#define CPE_LLC_1_CCUCMCR_MNTOP_WIDTH            (4U)
#define CPE_LLC_1_CCUCMCR_MNTOP(x)               (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMCR_MNTOP_SHIFT)) & CPE_LLC_1_CCUCMCR_MNTOP_MASK)

#define CPE_LLC_1_CCUCMCR_ARRAYID_MASK           (0x3F0000U)
#define CPE_LLC_1_CCUCMCR_ARRAYID_SHIFT          (16U)
#define CPE_LLC_1_CCUCMCR_ARRAYID_WIDTH          (6U)
#define CPE_LLC_1_CCUCMCR_ARRAYID(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMCR_ARRAYID_SHIFT)) & CPE_LLC_1_CCUCMCR_ARRAYID_MASK)

