zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
#define CPE_LLC_1_CCUCMCR_SECATTR_MASK           (0x400000U)
#define CPE_LLC_1_CCUCMCR_SECATTR_SHIFT          (22U)
#define CPE_LLC_1_CCUCMCR_SECATTR_WIDTH          (1U)
#define CPE_LLC_1_CCUCMCR_SECATTR(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMCR_SECATTR_SHIFT)) & CPE_LLC_1_CCUCMCR_SECATTR_MASK)
/*! @} */

/*! @name CCUCMAR - Maintenance Activity */
/*! @{ */

#define CPE_LLC_1_CCUCMAR_MNTOPACTV_MASK         (0x1U)
#define CPE_LLC_1_CCUCMAR_MNTOPACTV_SHIFT        (0U)
#define CPE_LLC_1_CCUCMAR_MNTOPACTV_WIDTH        (1U)
#define CPE_LLC_1_CCUCMAR_MNTOPACTV(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMAR_MNTOPACTV_SHIFT)) & CPE_LLC_1_CCUCMAR_MNTOPACTV_MASK)
/*! @} */

/*! @name CCUCMLR0 - Maintenance Location 0 */
/*! @{ */

#define CPE_LLC_1_CCUCMLR0_MNTSET_MASK           (0x7FFFU)
#define CPE_LLC_1_CCUCMLR0_MNTSET_SHIFT          (0U)
#define CPE_LLC_1_CCUCMLR0_MNTSET_WIDTH          (15U)
#define CPE_LLC_1_CCUCMLR0_MNTSET(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMLR0_MNTSET_SHIFT)) & CPE_LLC_1_CCUCMLR0_MNTSET_MASK)

#define CPE_LLC_1_CCUCMLR0_MNTWAY_MASK           (0x1F8000U)
#define CPE_LLC_1_CCUCMLR0_MNTWAY_SHIFT          (15U)
#define CPE_LLC_1_CCUCMLR0_MNTWAY_WIDTH          (6U)
#define CPE_LLC_1_CCUCMLR0_MNTWAY(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMLR0_MNTWAY_SHIFT)) & CPE_LLC_1_CCUCMLR0_MNTWAY_MASK)

#define CPE_LLC_1_CCUCMLR0_MNTWORD_MASK          (0xFFE00000U)
#define CPE_LLC_1_CCUCMLR0_MNTWORD_SHIFT         (21U)
#define CPE_LLC_1_CCUCMLR0_MNTWORD_WIDTH         (11U)
#define CPE_LLC_1_CCUCMLR0_MNTWORD(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMLR0_MNTWORD_SHIFT)) & CPE_LLC_1_CCUCMLR0_MNTWORD_MASK)
/*! @} */

/*! @name CCUCMLR1 - Maintenance Location 1 */
/*! @{ */

#define CPE_LLC_1_CCUCMLR1_MNTADDR_MASK          (0xFFFFU)
#define CPE_LLC_1_CCUCMLR1_MNTADDR_SHIFT         (0U)
#define CPE_LLC_1_CCUCMLR1_MNTADDR_WIDTH         (16U)
#define CPE_LLC_1_CCUCMLR1_MNTADDR(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMLR1_MNTADDR_SHIFT)) & CPE_LLC_1_CCUCMLR1_MNTADDR_MASK)
/*! @} */

/*! @name CCUCMLR2 - Maintenance Location 2 */
/*! @{ */

#define CPE_LLC_1_CCUCMLR2_MNTRANGE_MASK         (0xFFFFU)
#define CPE_LLC_1_CCUCMLR2_MNTRANGE_SHIFT        (0U)
#define CPE_LLC_1_CCUCMLR2_MNTRANGE_WIDTH        (16U)
#define CPE_LLC_1_CCUCMLR2_MNTRANGE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMLR2_MNTRANGE_SHIFT)) & CPE_LLC_1_CCUCMLR2_MNTRANGE_MASK)
/*! @} */

/*! @name CCUCMDR - Maintenance Data */
/*! @{ */

#define CPE_LLC_1_CCUCMDR_MNTDATA_MASK           (0xFFFFFFFFU)
#define CPE_LLC_1_CCUCMDR_MNTDATA_SHIFT          (0U)
#define CPE_LLC_1_CCUCMDR_MNTDATA_WIDTH          (32U)
#define CPE_LLC_1_CCUCMDR_MNTDATA(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMDR_MNTDATA_SHIFT)) & CPE_LLC_1_CCUCMDR_MNTDATA_MASK)
/*! @} */

/*! @name CCUCMWVR - Maintenance Way Valid */
/*! @{ */

#define CPE_LLC_1_CCUCMWVR_WAYVALID_MASK         (0xFFU)
#define CPE_LLC_1_CCUCMWVR_WAYVALID_SHIFT        (0U)
#define CPE_LLC_1_CCUCMWVR_WAYVALID_WIDTH        (8U)
#define CPE_LLC_1_CCUCMWVR_WAYVALID(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCMWVR_WAYVALID_SHIFT)) & CPE_LLC_1_CCUCMWVR_WAYVALID_MASK)
/*! @} */

/*! @name CCUCECR - Correctable Error Control */
/*! @{ */

#define CPE_LLC_1_CCUCECR_ERRDETEN_MASK          (0x1U)
#define CPE_LLC_1_CCUCECR_ERRDETEN_SHIFT         (0U)
#define CPE_LLC_1_CCUCECR_ERRDETEN_WIDTH         (1U)
#define CPE_LLC_1_CCUCECR_ERRDETEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCECR_ERRDETEN_SHIFT)) & CPE_LLC_1_CCUCECR_ERRDETEN_MASK)

#define CPE_LLC_1_CCUCECR_ERRINTEN_MASK          (0x2U)
#define CPE_LLC_1_CCUCECR_ERRINTEN_SHIFT         (1U)
#define CPE_LLC_1_CCUCECR_ERRINTEN_WIDTH         (1U)
#define CPE_LLC_1_CCUCECR_ERRINTEN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCECR_ERRINTEN_SHIFT)) & CPE_LLC_1_CCUCECR_ERRINTEN_MASK)

#define CPE_LLC_1_CCUCECR_ERRTHRESHOLD_MASK      (0xFF0U)
#define CPE_LLC_1_CCUCECR_ERRTHRESHOLD_SHIFT     (4U)
#define CPE_LLC_1_CCUCECR_ERRTHRESHOLD_WIDTH     (8U)
#define CPE_LLC_1_CCUCECR_ERRTHRESHOLD(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCECR_ERRTHRESHOLD_SHIFT)) & CPE_LLC_1_CCUCECR_ERRTHRESHOLD_MASK)
/*! @} */

/*! @name CCUCESR - Correctable Error Status */
/*! @{ */

#define CPE_LLC_1_CCUCESR_CERRVLD_MASK           (0x1U)
#define CPE_LLC_1_CCUCESR_CERRVLD_SHIFT          (0U)
#define CPE_LLC_1_CCUCESR_CERRVLD_WIDTH          (1U)
#define CPE_LLC_1_CCUCESR_CERRVLD(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESR_CERRVLD_SHIFT)) & CPE_LLC_1_CCUCESR_CERRVLD_MASK)

#define CPE_LLC_1_CCUCESR_CERRCOUNTOVERFLOW_MASK (0x2U)
#define CPE_LLC_1_CCUCESR_CERRCOUNTOVERFLOW_SHIFT (1U)
#define CPE_LLC_1_CCUCESR_CERRCOUNTOVERFLOW_WIDTH (1U)
#define CPE_LLC_1_CCUCESR_CERRCOUNTOVERFLOW(x)   (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESR_CERRCOUNTOVERFLOW_SHIFT)) & CPE_LLC_1_CCUCESR_CERRCOUNTOVERFLOW_MASK)

#define CPE_LLC_1_CCUCESR_CERRCOUNT_MASK         (0x3FCU)
#define CPE_LLC_1_CCUCESR_CERRCOUNT_SHIFT        (2U)
#define CPE_LLC_1_CCUCESR_CERRCOUNT_WIDTH        (8U)
#define CPE_LLC_1_CCUCESR_CERRCOUNT(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESR_CERRCOUNT_SHIFT)) & CPE_LLC_1_CCUCESR_CERRCOUNT_MASK)

#define CPE_LLC_1_CCUCESR_CERRTYPE_MASK          (0xF800U)
#define CPE_LLC_1_CCUCESR_CERRTYPE_SHIFT         (11U)
#define CPE_LLC_1_CCUCESR_CERRTYPE_WIDTH         (5U)
#define CPE_LLC_1_CCUCESR_CERRTYPE(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESR_CERRTYPE_SHIFT)) & CPE_LLC_1_CCUCESR_CERRTYPE_MASK)

#define CPE_LLC_1_CCUCESR_CERRINFO_MASK          (0xFFFF0000U)
#define CPE_LLC_1_CCUCESR_CERRINFO_SHIFT         (16U)
#define CPE_LLC_1_CCUCESR_CERRINFO_WIDTH         (16U)
#define CPE_LLC_1_CCUCESR_CERRINFO(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESR_CERRINFO_SHIFT)) & CPE_LLC_1_CCUCESR_CERRINFO_MASK)
/*! @} */

/*! @name CCUCESAR - Correctable Error Status Alias */
/*! @{ */

#define CPE_LLC_1_CCUCESAR_CERRVLD_MASK          (0x1U)
#define CPE_LLC_1_CCUCESAR_CERRVLD_SHIFT         (0U)
#define CPE_LLC_1_CCUCESAR_CERRVLD_WIDTH         (1U)
#define CPE_LLC_1_CCUCESAR_CERRVLD(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESAR_CERRVLD_SHIFT)) & CPE_LLC_1_CCUCESAR_CERRVLD_MASK)

#define CPE_LLC_1_CCUCESAR_CERRCOUNTOVERFLOW_MASK (0x2U)
#define CPE_LLC_1_CCUCESAR_CERRCOUNTOVERFLOW_SHIFT (1U)
#define CPE_LLC_1_CCUCESAR_CERRCOUNTOVERFLOW_WIDTH (1U)
#define CPE_LLC_1_CCUCESAR_CERRCOUNTOVERFLOW(x)  (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESAR_CERRCOUNTOVERFLOW_SHIFT)) & CPE_LLC_1_CCUCESAR_CERRCOUNTOVERFLOW_MASK)

#define CPE_LLC_1_CCUCESAR_CERRCOUNT_MASK        (0x3FCU)
#define CPE_LLC_1_CCUCESAR_CERRCOUNT_SHIFT       (2U)
#define CPE_LLC_1_CCUCESAR_CERRCOUNT_WIDTH       (8U)
#define CPE_LLC_1_CCUCESAR_CERRCOUNT(x)          (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESAR_CERRCOUNT_SHIFT)) & CPE_LLC_1_CCUCESAR_CERRCOUNT_MASK)

#define CPE_LLC_1_CCUCESAR_CERRTYPE_MASK         (0xF800U)
#define CPE_LLC_1_CCUCESAR_CERRTYPE_SHIFT        (11U)
#define CPE_LLC_1_CCUCESAR_CERRTYPE_WIDTH        (5U)
#define CPE_LLC_1_CCUCESAR_CERRTYPE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESAR_CERRTYPE_SHIFT)) & CPE_LLC_1_CCUCESAR_CERRTYPE_MASK)

#define CPE_LLC_1_CCUCESAR_CERRINFO_MASK         (0xFFFF0000U)
#define CPE_LLC_1_CCUCESAR_CERRINFO_SHIFT        (16U)
#define CPE_LLC_1_CCUCESAR_CERRINFO_WIDTH        (16U)
#define CPE_LLC_1_CCUCESAR_CERRINFO(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCESAR_CERRINFO_SHIFT)) & CPE_LLC_1_CCUCESAR_CERRINFO_MASK)
/*! @} */

