zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
/*! @name CCUCELR0 - Correctable Error Location 0 */
/*! @{ */

#define CPE_LLC_1_CCUCELR0_ERRENTRY_MASK         (0x7FFFU)
#define CPE_LLC_1_CCUCELR0_ERRENTRY_SHIFT        (0U)
#define CPE_LLC_1_CCUCELR0_ERRENTRY_WIDTH        (15U)
#define CPE_LLC_1_CCUCELR0_ERRENTRY(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCELR0_ERRENTRY_SHIFT)) & CPE_LLC_1_CCUCELR0_ERRENTRY_MASK)

#define CPE_LLC_1_CCUCELR0_ERRWAY_MASK           (0x1F8000U)
#define CPE_LLC_1_CCUCELR0_ERRWAY_SHIFT          (15U)
#define CPE_LLC_1_CCUCELR0_ERRWAY_WIDTH          (6U)
#define CPE_LLC_1_CCUCELR0_ERRWAY(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCELR0_ERRWAY_SHIFT)) & CPE_LLC_1_CCUCELR0_ERRWAY_MASK)

#define CPE_LLC_1_CCUCELR0_ERRWORD_MASK          (0xFFE00000U)
#define CPE_LLC_1_CCUCELR0_ERRWORD_SHIFT         (21U)
#define CPE_LLC_1_CCUCELR0_ERRWORD_WIDTH         (11U)
#define CPE_LLC_1_CCUCELR0_ERRWORD(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCELR0_ERRWORD_SHIFT)) & CPE_LLC_1_CCUCELR0_ERRWORD_MASK)
/*! @} */

/*! @name CCUCELR1 - Correctable Error Location 1 */
/*! @{ */

#define CPE_LLC_1_CCUCELR1_ERRADDR_MASK          (0x7FFFFFFFU)
#define CPE_LLC_1_CCUCELR1_ERRADDR_SHIFT         (0U)
#define CPE_LLC_1_CCUCELR1_ERRADDR_WIDTH         (31U)
#define CPE_LLC_1_CCUCELR1_ERRADDR(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCELR1_ERRADDR_SHIFT)) & CPE_LLC_1_CCUCELR1_ERRADDR_MASK)
/*! @} */

/*! @name CCUUEDR - Uncorrectable Error Detect */
/*! @{ */

#define CPE_LLC_1_CCUUEDR_PROTERRDETEN_MASK      (0x1U)
#define CPE_LLC_1_CCUUEDR_PROTERRDETEN_SHIFT     (0U)
#define CPE_LLC_1_CCUUEDR_PROTERRDETEN_WIDTH     (1U)
#define CPE_LLC_1_CCUUEDR_PROTERRDETEN(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUEDR_PROTERRDETEN_SHIFT)) & CPE_LLC_1_CCUUEDR_PROTERRDETEN_MASK)

#define CPE_LLC_1_CCUUEDR_MEMERRDETEN_MASK       (0x2U)
#define CPE_LLC_1_CCUUEDR_MEMERRDETEN_SHIFT      (1U)
#define CPE_LLC_1_CCUUEDR_MEMERRDETEN_WIDTH      (1U)
#define CPE_LLC_1_CCUUEDR_MEMERRDETEN(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUEDR_MEMERRDETEN_SHIFT)) & CPE_LLC_1_CCUUEDR_MEMERRDETEN_MASK)
/*! @} */

/*! @name CCUUEIR - Uncorrectable Error Interrupt */
/*! @{ */

#define CPE_LLC_1_CCUUEIR_MEMERRINTEN_MASK       (0x2U)
#define CPE_LLC_1_CCUUEIR_MEMERRINTEN_SHIFT      (1U)
#define CPE_LLC_1_CCUUEIR_MEMERRINTEN_WIDTH      (1U)
#define CPE_LLC_1_CCUUEIR_MEMERRINTEN(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUEIR_MEMERRINTEN_SHIFT)) & CPE_LLC_1_CCUUEIR_MEMERRINTEN_MASK)
/*! @} */

/*! @name CCUUESR - Uncorrectable Error Status */
/*! @{ */

#define CPE_LLC_1_CCUUESR_UERRVLD_MASK           (0x1U)
#define CPE_LLC_1_CCUUESR_UERRVLD_SHIFT          (0U)
#define CPE_LLC_1_CCUUESR_UERRVLD_WIDTH          (1U)
#define CPE_LLC_1_CCUUESR_UERRVLD(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUESR_UERRVLD_SHIFT)) & CPE_LLC_1_CCUUESR_UERRVLD_MASK)

#define CPE_LLC_1_CCUUESR_UERRTYPE_MASK          (0x1F0U)
#define CPE_LLC_1_CCUUESR_UERRTYPE_SHIFT         (4U)
#define CPE_LLC_1_CCUUESR_UERRTYPE_WIDTH         (5U)
#define CPE_LLC_1_CCUUESR_UERRTYPE(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUESR_UERRTYPE_SHIFT)) & CPE_LLC_1_CCUUESR_UERRTYPE_MASK)

#define CPE_LLC_1_CCUUESR_UERRINFO_MASK          (0xFFFF0000U)
#define CPE_LLC_1_CCUUESR_UERRINFO_SHIFT         (16U)
#define CPE_LLC_1_CCUUESR_UERRINFO_WIDTH         (16U)
#define CPE_LLC_1_CCUUESR_UERRINFO(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUESR_UERRINFO_SHIFT)) & CPE_LLC_1_CCUUESR_UERRINFO_MASK)
/*! @} */

/*! @name CCUUESAR - Uncorrectable Error Status Alias */
/*! @{ */

#define CPE_LLC_1_CCUUESAR_UERRVLD_MASK          (0x1U)
#define CPE_LLC_1_CCUUESAR_UERRVLD_SHIFT         (0U)
#define CPE_LLC_1_CCUUESAR_UERRVLD_WIDTH         (1U)
#define CPE_LLC_1_CCUUESAR_UERRVLD(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUESAR_UERRVLD_SHIFT)) & CPE_LLC_1_CCUUESAR_UERRVLD_MASK)

#define CPE_LLC_1_CCUUESAR_UERRTYPE_MASK         (0x1F0U)
#define CPE_LLC_1_CCUUESAR_UERRTYPE_SHIFT        (4U)
#define CPE_LLC_1_CCUUESAR_UERRTYPE_WIDTH        (5U)
#define CPE_LLC_1_CCUUESAR_UERRTYPE(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUESAR_UERRTYPE_SHIFT)) & CPE_LLC_1_CCUUESAR_UERRTYPE_MASK)

#define CPE_LLC_1_CCUUESAR_UERRINFO_MASK         (0xFFFF0000U)
#define CPE_LLC_1_CCUUESAR_UERRINFO_SHIFT        (16U)
#define CPE_LLC_1_CCUUESAR_UERRINFO_WIDTH        (16U)
#define CPE_LLC_1_CCUUESAR_UERRINFO(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUESAR_UERRINFO_SHIFT)) & CPE_LLC_1_CCUUESAR_UERRINFO_MASK)
/*! @} */

/*! @name CCUUELR0 - Uncorrectable Error Location 0 */
/*! @{ */

#define CPE_LLC_1_CCUUELR0_ERRENTRY_MASK         (0x7FFFU)
#define CPE_LLC_1_CCUUELR0_ERRENTRY_SHIFT        (0U)
#define CPE_LLC_1_CCUUELR0_ERRENTRY_WIDTH        (15U)
#define CPE_LLC_1_CCUUELR0_ERRENTRY(x)           (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUELR0_ERRENTRY_SHIFT)) & CPE_LLC_1_CCUUELR0_ERRENTRY_MASK)

#define CPE_LLC_1_CCUUELR0_ERRWAY_MASK           (0x1F8000U)
#define CPE_LLC_1_CCUUELR0_ERRWAY_SHIFT          (15U)
#define CPE_LLC_1_CCUUELR0_ERRWAY_WIDTH          (6U)
#define CPE_LLC_1_CCUUELR0_ERRWAY(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUELR0_ERRWAY_SHIFT)) & CPE_LLC_1_CCUUELR0_ERRWAY_MASK)

#define CPE_LLC_1_CCUUELR0_ERRWORD_MASK          (0xFFE00000U)
#define CPE_LLC_1_CCUUELR0_ERRWORD_SHIFT         (21U)
#define CPE_LLC_1_CCUUELR0_ERRWORD_WIDTH         (11U)
#define CPE_LLC_1_CCUUELR0_ERRWORD(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUELR0_ERRWORD_SHIFT)) & CPE_LLC_1_CCUUELR0_ERRWORD_MASK)
/*! @} */

/*! @name CCUUELR1 - Uncorrectable Error Location 1 */
/*! @{ */

#define CPE_LLC_1_CCUUELR1_ERRADDR_MASK          (0x7FFFFFFFU)
#define CPE_LLC_1_CCUUELR1_ERRADDR_SHIFT         (0U)
#define CPE_LLC_1_CCUUELR1_ERRADDR_WIDTH         (31U)
#define CPE_LLC_1_CCUUELR1_ERRADDR(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUUELR1_ERRADDR_SHIFT)) & CPE_LLC_1_CCUUELR1_ERRADDR_MASK)
/*! @} */

