zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
/*! @name CCUIIDR - Instance Identification */
/*! @{ */

#define CPE_LLC_1_CCUIIDR_INSTANCE_ID_MASK       (0xFFFFFFFFU)
#define CPE_LLC_1_CCUIIDR_INSTANCE_ID_SHIFT      (0U)
#define CPE_LLC_1_CCUIIDR_INSTANCE_ID_WIDTH      (32U)
#define CPE_LLC_1_CCUIIDR_INSTANCE_ID(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUIIDR_INSTANCE_ID_SHIFT)) & CPE_LLC_1_CCUIIDR_INSTANCE_ID_MASK)
/*! @} */

/*! @name CCUIDR - Version Identification */
/*! @{ */

#define CPE_LLC_1_CCUIDR_PATCHRELVER_MASK        (0xFU)
#define CPE_LLC_1_CCUIDR_PATCHRELVER_SHIFT       (0U)
#define CPE_LLC_1_CCUIDR_PATCHRELVER_WIDTH       (4U)
#define CPE_LLC_1_CCUIDR_PATCHRELVER(x)          (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUIDR_PATCHRELVER_SHIFT)) & CPE_LLC_1_CCUIDR_PATCHRELVER_MASK)

#define CPE_LLC_1_CCUIDR_MINRELVER_MASK          (0xF0U)
#define CPE_LLC_1_CCUIDR_MINRELVER_SHIFT         (4U)
#define CPE_LLC_1_CCUIDR_MINRELVER_WIDTH         (4U)
#define CPE_LLC_1_CCUIDR_MINRELVER(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUIDR_MINRELVER_SHIFT)) & CPE_LLC_1_CCUIDR_MINRELVER_MASK)

#define CPE_LLC_1_CCUIDR_MAJRELVER_MASK          (0xF00U)
#define CPE_LLC_1_CCUIDR_MAJRELVER_SHIFT         (8U)
#define CPE_LLC_1_CCUIDR_MAJRELVER_WIDTH         (4U)
#define CPE_LLC_1_CCUIDR_MAJRELVER(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUIDR_MAJRELVER_SHIFT)) & CPE_LLC_1_CCUIDR_MAJRELVER_MASK)
/*! @} */

/*! @name CCUCRTR - Correctable Resiliency Threshold */
/*! @{ */

#define CPE_LLC_1_CCUCRTR_RESTHRESHOLD_MASK      (0xFFU)
#define CPE_LLC_1_CCUCRTR_RESTHRESHOLD_SHIFT     (0U)
#define CPE_LLC_1_CCUCRTR_RESTHRESHOLD_WIDTH     (8U)
#define CPE_LLC_1_CCUCRTR_RESTHRESHOLD(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUCRTR_RESTHRESHOLD_SHIFT)) & CPE_LLC_1_CCUCRTR_RESTHRESHOLD_MASK)
/*! @} */

/*! @name CCUESR - Event Status */
/*! @{ */

#define CPE_LLC_1_CCUESR_STATUS_MASK             (0x3U)
#define CPE_LLC_1_CCUESR_STATUS_SHIFT            (0U)
#define CPE_LLC_1_CCUESR_STATUS_WIDTH            (2U)
#define CPE_LLC_1_CCUESR_STATUS(x)               (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUESR_STATUS_SHIFT)) & CPE_LLC_1_CCUESR_STATUS_MASK)
/*! @} */

/*! @name CCUEMR - Event Mask */
/*! @{ */

#define CPE_LLC_1_CCUEMR_MASK_MASK               (0x3U)
#define CPE_LLC_1_CCUEMR_MASK_SHIFT              (0U)
#define CPE_LLC_1_CCUEMR_MASK_WIDTH              (2U)
#define CPE_LLC_1_CCUEMR_MASK(x)                 (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUEMR_MASK_SHIFT)) & CPE_LLC_1_CCUEMR_MASK_MASK)
/*! @} */

/*! @name CCUEAR - Event Alias */
/*! @{ */

#define CPE_LLC_1_CCUEAR_ALIAS_MASK              (0x3U)
#define CPE_LLC_1_CCUEAR_ALIAS_SHIFT             (0U)
#define CPE_LLC_1_CCUEAR_ALIAS_WIDTH             (2U)
#define CPE_LLC_1_CCUEAR_ALIAS(x)                (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUEAR_ALIAS_SHIFT)) & CPE_LLC_1_CCUEAR_ALIAS_MASK)
/*! @} */

/*! @name CCUHI - Hardware Information */
/*! @{ */

#define CPE_LLC_1_CCUHI_AXIDATAWIDTH_MASK        (0x7U)
#define CPE_LLC_1_CCUHI_AXIDATAWIDTH_SHIFT       (0U)
#define CPE_LLC_1_CCUHI_AXIDATAWIDTH_WIDTH       (3U)
#define CPE_LLC_1_CCUHI_AXIDATAWIDTH(x)          (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUHI_AXIDATAWIDTH_SHIFT)) & CPE_LLC_1_CCUHI_AXIDATAWIDTH_MASK)

#define CPE_LLC_1_CCUHI_CACHELINESIZE_MASK       (0x30000U)
#define CPE_LLC_1_CCUHI_CACHELINESIZE_SHIFT      (16U)
#define CPE_LLC_1_CCUHI_CACHELINESIZE_WIDTH      (2U)
#define CPE_LLC_1_CCUHI_CACHELINESIZE(x)         (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUHI_CACHELINESIZE_SHIFT)) & CPE_LLC_1_CCUHI_CACHELINESIZE_MASK)
/*! @} */

/*! @name CCUPMHI - Performance Monitor Hardware Information */
/*! @{ */

#define CPE_LLC_1_CCUPMHI_COUNTERWIDTH_MASK      (0xFFU)
#define CPE_LLC_1_CCUPMHI_COUNTERWIDTH_SHIFT     (0U)
#define CPE_LLC_1_CCUPMHI_COUNTERWIDTH_WIDTH     (8U)
#define CPE_LLC_1_CCUPMHI_COUNTERWIDTH(x)        (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMHI_COUNTERWIDTH_SHIFT)) & CPE_LLC_1_CCUPMHI_COUNTERWIDTH_MASK)

#define CPE_LLC_1_CCUPMHI_FREERUN_MASK           (0x100U)
#define CPE_LLC_1_CCUPMHI_FREERUN_SHIFT          (8U)
#define CPE_LLC_1_CCUPMHI_FREERUN_WIDTH          (1U)
#define CPE_LLC_1_CCUPMHI_FREERUN(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMHI_FREERUN_SHIFT)) & CPE_LLC_1_CCUPMHI_FREERUN_MASK)
/*! @} */

/*! @name CCUPMCTL - Performance Monitor Control */
/*! @{ */

#define CPE_LLC_1_CCUPMCTL_SWRESET_MASK          (0x1U)
#define CPE_LLC_1_CCUPMCTL_SWRESET_SHIFT         (0U)
#define CPE_LLC_1_CCUPMCTL_SWRESET_WIDTH         (1U)
#define CPE_LLC_1_CCUPMCTL_SWRESET(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMCTL_SWRESET_SHIFT)) & CPE_LLC_1_CCUPMCTL_SWRESET_MASK)

#define CPE_LLC_1_CCUPMCTL_ENABLE_MASK           (0x2U)
#define CPE_LLC_1_CCUPMCTL_ENABLE_SHIFT          (1U)
#define CPE_LLC_1_CCUPMCTL_ENABLE_WIDTH          (1U)
#define CPE_LLC_1_CCUPMCTL_ENABLE(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMCTL_ENABLE_SHIFT)) & CPE_LLC_1_CCUPMCTL_ENABLE_MASK)

#define CPE_LLC_1_CCUPMCTL_FREERUN_MASK          (0x4U)
#define CPE_LLC_1_CCUPMCTL_FREERUN_SHIFT         (2U)
#define CPE_LLC_1_CCUPMCTL_FREERUN_WIDTH         (1U)
#define CPE_LLC_1_CCUPMCTL_FREERUN(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMCTL_FREERUN_SHIFT)) & CPE_LLC_1_CCUPMCTL_FREERUN_MASK)

#define CPE_LLC_1_CCUPMCTL_HARDWARE_TRIGGER_MASK (0x100U)
#define CPE_LLC_1_CCUPMCTL_HARDWARE_TRIGGER_SHIFT (8U)
#define CPE_LLC_1_CCUPMCTL_HARDWARE_TRIGGER_WIDTH (1U)
#define CPE_LLC_1_CCUPMCTL_HARDWARE_TRIGGER(x)   (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMCTL_HARDWARE_TRIGGER_SHIFT)) & CPE_LLC_1_CCUPMCTL_HARDWARE_TRIGGER_MASK)
/*! @} */

/*! @name CCUPMSC - Performance Monitor Slot Configuration */
/*! @{ */

#define CPE_LLC_1_CCUPMSC_DURATION_MASK          (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMSC_DURATION_SHIFT         (0U)
#define CPE_LLC_1_CCUPMSC_DURATION_WIDTH         (32U)
#define CPE_LLC_1_CCUPMSC_DURATION(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMSC_DURATION_SHIFT)) & CPE_LLC_1_CCUPMSC_DURATION_MASK)
/*! @} */

/*! @name CCUPMOTC - Performance Monitor OTT Threshold Configuration */
/*! @{ */

#define CPE_LLC_1_CCUPMOTC_RTT_MASK              (0x1FU)
#define CPE_LLC_1_CCUPMOTC_RTT_SHIFT             (0U)
#define CPE_LLC_1_CCUPMOTC_RTT_WIDTH             (5U)
#define CPE_LLC_1_CCUPMOTC_RTT(x)                (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMOTC_RTT_SHIFT)) & CPE_LLC_1_CCUPMOTC_RTT_MASK)

