zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_CPE_LLC_1.h
/*! @name CCUPMWRCA - Performance Monitor Write Request Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMWRCA_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMWRCA_COUNT_SHIFT          (0U)
#define CPE_LLC_1_CCUPMWRCA_COUNT_WIDTH          (32U)
#define CPE_LLC_1_CCUPMWRCA_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMWRCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMWRCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMCRRCA - Performance Monitor Cacheable Read Request Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMCRRCA_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMCRRCA_COUNT_SHIFT         (0U)
#define CPE_LLC_1_CCUPMCRRCA_COUNT_WIDTH         (32U)
#define CPE_LLC_1_CCUPMCRRCA_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMCRRCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMCRRCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMCWRCA - Performance Monitor Cacheable Write Request Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMCWRCA_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMCWRCA_COUNT_SHIFT         (0U)
#define CPE_LLC_1_CCUPMCWRCA_COUNT_WIDTH         (32U)
#define CPE_LLC_1_CCUPMCWRCA_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMCWRCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMCWRCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMRHCA - Performance Monitor Read Hit Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMRHCA_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMRHCA_COUNT_SHIFT          (0U)
#define CPE_LLC_1_CCUPMRHCA_COUNT_WIDTH          (32U)
#define CPE_LLC_1_CCUPMRHCA_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMRHCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMRHCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMWHCA - Performance Monitor Write Hit Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMWHCA_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMWHCA_COUNT_SHIFT          (0U)
#define CPE_LLC_1_CCUPMWHCA_COUNT_WIDTH          (32U)
#define CPE_LLC_1_CCUPMWHCA_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMWHCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMWHCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMECA - Performance Monitor Eviction Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMECA_COUNT_MASK            (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMECA_COUNT_SHIFT           (0U)
#define CPE_LLC_1_CCUPMECA_COUNT_WIDTH           (32U)
#define CPE_LLC_1_CCUPMECA_COUNT(x)              (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMECA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMECA_COUNT_MASK)
/*! @} */

/*! @name CCUPMRBCA - Performance Monitor Read Beat Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMRBCA_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMRBCA_COUNT_SHIFT          (0U)
#define CPE_LLC_1_CCUPMRBCA_COUNT_WIDTH          (32U)
#define CPE_LLC_1_CCUPMRBCA_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMRBCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMRBCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMWBCA - Performance Monitor Write Beat Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMWBCA_COUNT_MASK           (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMWBCA_COUNT_SHIFT          (0U)
#define CPE_LLC_1_CCUPMWBCA_COUNT_WIDTH          (32U)
#define CPE_LLC_1_CCUPMWBCA_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMWBCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMWBCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMRATCA - Performance Monitor RTT Above Threshold Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMRATCA_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMRATCA_COUNT_SHIFT         (0U)
#define CPE_LLC_1_CCUPMRATCA_COUNT_WIDTH         (32U)
#define CPE_LLC_1_CCUPMRATCA_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMRATCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMRATCA_COUNT_MASK)
/*! @} */

/*! @name CCUPMWATCA - Performance Monitor WTT Above Threshold Counter Capture */
/*! @{ */

#define CPE_LLC_1_CCUPMWATCA_COUNT_MASK          (0xFFFFFFFFU)
#define CPE_LLC_1_CCUPMWATCA_COUNT_SHIFT         (0U)
#define CPE_LLC_1_CCUPMWATCA_COUNT_WIDTH         (32U)
#define CPE_LLC_1_CCUPMWATCA_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << CPE_LLC_1_CCUPMWATCA_COUNT_SHIFT)) & CPE_LLC_1_CCUPMWATCA_COUNT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group CPE_LLC_1_Register_Masks */

/*!
 * @}
 */ /* end of group CPE_LLC_1_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_CPE_LLC_1_H_) */
